InformationRegisters/ЗаданияТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТестирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазультатТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоставЗаданийТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СоставЗаданийТестирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АлгоритмТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АлгоритмыТестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ТестированиеПриложенийСервер/Ext/Module.bsl
Процедура ТестоваяПроцедура(Текст) Экспорт 
	
	ЗаписьЖурналаРегистрации("ПараметрыЗапуска",УровеньЖурналаРегистрации.Примечание,,,Текст);

КонецПроцедуры

Функция СвободныйПорт() Экспорт 
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("", );
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЗаданияТестирования.Порт) КАК Порт
	               |ИЗ
	               |	РегистрСведений.ЗаданияТестирования КАК ЗаданияТестирования
	               |ГДЕ
	               |	ЗаданияТестирования.ОкончаниеТестирования = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() и не Выборка.Порт = null Тогда
		Возврат Выборка.Порт + 1;
	Иначе
		Возврат Константы.НачальныйПортКлиента.Получить();		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУИДЫНовыхТестов() Экспорт 
	Запрос = Новый Запрос;      
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияТестирования.УИД КАК УИД
	               |ИЗ
	               |	РегистрСведений.ЗаданияТестирования КАК ЗаданияТестирования
	               |ГДЕ
	               |	ЗаданияТестирования.НачалоТестирования = ДАТАВРЕМЯ(1, 1, 1)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УИД");	
	
КонецФункции

Функция СтрокаПодключенияМенеджераТеста(УИД) Экспорт 
	
	Логин = Константы.МенеджерТестированияПользователь.Получить();
	Пароль = Константы.МенеджерТестированияПароль.Получить();
	
	Возврат СтрШаблон("%1 ENTERPRISE /S %2\%3 /TESTMANAGER %4 %5 /c task_%6",
		                  Константы.ИсполняемыйФайл1С.Получить(),
						  Константы.МенеджерТестированияСервер.Получить(),
						  Константы.МенеджерТестированияБаза.Получить(),
						  ?(ЗначениеЗаполнено(Логин), "/N "+Логин, ""),
						  ?(ЗначениеЗаполнено(Пароль), "/P "+Пароль, ""),
						  УИД
						);
		
КонецФункции
					
Функция ДанныеТестированияПоУИДУ(УИД) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УИД", УИД);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияТестирования.ИнформационнаяБаза КАК ИнформационнаяБаза,
	               |	ЗаданияТестирования.Порт КАК Порт
	               |ИЗ
	               |	РегистрСведений.ЗаданияТестирования КАК ЗаданияТестирования
	               |ГДЕ
	               |	ЗаданияТестирования.УИД = &УИД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СоставЗаданийТестирования.АлгоритмТестирования КАК АлгоритмТестирования,
	               |	СоставЗаданийТестирования.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.СоставЗаданийТестирования КАК СоставЗаданийТестирования
	               |ГДЕ
	               |	СоставЗаданийТестирования.УИД = &УИД
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СоставЗаданийТестирования.Порядок";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура("Алгоритмы, ИнформационнаяБаза, Порт, СтрокаПодключения", Новый Массив);
	
	СтрокаЗадания = Пакет[0].Выгрузить()[0];	
	ЗаполнитьЗначенияСвойств(Результат, СтрокаЗадания);
	
	ТаблицаТестов = Пакет[1].Выгрузить();
	
	Для Каждого Тест из ТаблицаТестов Цикл
		Результат.Алгоритмы.Добавить(Новый Структура("Алгоритм, КодАлгоритма, Количество", Тест.АлгоритмТестирования.Наименование, Тест.АлгоритмТестирования.Алгоритм, Тест.Количество)); 		
	КонецЦикла;
	
	Результат.СтрокаПодключения = СтрокаПодключенийКлиентаТестирования(Результат.ИнформационнаяБаза, Результат.Порт);
	
	Возврат Результат;	
	
КонецФункции

Функция СтрокаПодключенийКлиентаТестирования(ИнформационнаяБаза, Порт) Экспорт 
	
	Логин = ИнформационнаяБаза.Пользователь ;
	Пароль = ИнформационнаяБаза.Пароль ;
	
	Возврат СтрШаблон("%1 ENTERPRISE /S %2\%3 %4 %5 /TESTCLIENT -TPort %6",
		                  Константы.ИсполняемыйФайл1С.Получить(),
						  ИнформационнаяБаза.ИмяСервера,
						  ИнформационнаяБаза.ИмяБазы,
						  ?(ЗначениеЗаполнено(Логин), "/N "+Логин, ""),
						  ?(ЗначениеЗаполнено(Пароль), "/P "+Пароль, ""),
						  Формат(Порт, "ЧГ=0")
						);	
КонецФункции
					
Процедура ЗафиксироватьНачалоТестирования(УИД) Экспорт 
	
	РегистрыСведений.ЗаданияТестирования.ОбновитьИнформациюПоЗаданию(УИД, Новый Структура("НачалоТестирования", ТекущаяДата()));	
	
КонецПроцедуры

Процедура ЗафиксироватьСобытиеТестирования(УИД, Результат, Ошибки) Экспорт 
	РегистрыСведений.ЗаданияТестирования.ОбновитьИнформациюПоЗаданию(УИД, 
								Новый Структура("РазультатТестирования, Ошибки", 
									Результат,
									Ошибки)
								);	
КонецПроцедуры

Процедура ЗафиксироватьОкочаниеТестирования(УИД, Результат, Ошибки) Экспорт 
	
	РегистрыСведений.ЗаданияТестирования.ОбновитьИнформациюПоЗаданию(УИД, 
								Новый Структура("ОкончаниеТестирования, РазультатТестирования, Ошибки", 
									ТекущаяДата(),
									Результат,
									Ошибки)
								
								);	
	
КонецПроцедуры



Функция ВремяОжиданияЗапускаКлиента() Экспорт 
	Возврат Константы.ВремяОжиданияЗапускаКлиента.Получить();
КонецФункции
